1s/ERP/Conf/InformationRegisters/Лико_РегистрацияОперацийДляОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_РегистрацияОперацийДляОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>created_at</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>modified_at</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>listener</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>data</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>event</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>uuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_РегистрацияОперацийДляОбмена/Ext/ManagerModule.bsl
Функция ДобавитьСобытие(listener="dfm",event="СозданиеНоменклатуры",dataJson) Экспорт  //+Лико m.shenderov 26.01.2024
	
УстановитьПривилегированныйРежим(Истина);

	ТипыСобытий=ТипыСобытийОбмена();
	
	uuid = Строка(Новый УникальныйИдентификатор);	
	
	НаборЗаписей = РегистрыСведений.Лико_РегистрацияОперацийДляОбмена.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.uuid.Установить(uuid);
	
	Запись=НаборЗаписей.Добавить();
	Запись.uuid=uuid;
	Запись.created_at=ТекущаяДата();
	Запись.listener=listener;  
	Запись.event=ТипыСобытий[event];
	Запись.data=dataJson;
	НаборЗаписей.Записать(Истина);
	
	Возврат uuid;
	
КонецФункции //-Лико m.shenderov 26.01.2024


Функция ТипыСобытийОбмена() Экспорт  //+Лико m.shenderov 09.01.2024
	
	Структура = Новый Структура;
	Структура.Вставить("СозданиеНоменклатуры","create_article"); 
	Структура.Вставить("НаправитьЗаказВРаботу","send_order_to_work"); 
	Структура.Вставить("ОтправитьСообщение","send_notify");
	Структура.Вставить("ИзменитьНаименование","rename_product");

	
	Возврат Структура;
КонецФункции //-Лико m.shenderov 09.01.2024 


Процедура НаправитьЗаказВРаботу(Заказ) Экспорт  //+Лико m.shenderov 26.01.2024
УстановитьПривилегированныйРежим(Истина);	
	dataJson=Лико_HTTP_Сервер.СтруктураВJSON(
	Новый Структура("order_number,order_version,order_time",Заказ.Номер,Заказ.Версия,Заказ.Дата)
	); 
	
	
	uuid=ДобавитьСобытие(,"НаправитьЗаказВРаботу",dataJson); 
	
КонецПроцедуры //-Лико m.shenderov 26.01.2024

Процедура ИзменитьСтатус(uuid,status) Экспорт //+Лико m.shenderov 05.02.2024
УстановитьПривилегированныйРежим(Истина);	
		
		НаборЗаписей = РегистрыСведений.Лико_РегистрацияОперацийДляОбмена.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.uuid.Установить(uuid);
		НаборЗаписей.Прочитать();
		Для каждого Запись Из НаборЗаписей Цикл 
			Запись.modified_at=ТекущаяДата();
			Запись.status=status;
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
		


	
	
КонецПроцедуры //-Лико m.shenderov 05.02.2024
